app/Controllers/UserController.php

SELECT *
FROM `category`
SELECT *
FROM `author`
---
    public function add_books(){
        $data['pageTitle']='add books';
        $categoryModel = new Category();
        $data['category'] = $categoryModel->findAll();
        $authorModel = new Author();
        $data['author'] = $authorModel->findAll();

SELECT *
FROM `books`
ORDER BY `books_id` DESC
---
    public function books(){
        $books = new Books();
        $data['books'] = $books->orderBy('books_id', 'DESC')->findAll();

SELECT *
FROM `author`
ORDER BY `author_id` DESC
---
    public function authors(){
        $author = new Author();
        $data['author'] = $author->orderBy('author_id', 'DESC')->findAll();

SELECT *
FROM `students`
ORDER BY `student_id` DESC
---
    public function students(){
        $students = new Student();
        $data['students'] = $students->orderBy('student_id ', 'DESC')->findAll();

SELECT `issue`.`issue_id`, `issue`.`student_name`, `issue`.`book_name`, `issue`.`issue_date`, `issue`.`return_date`, `issue`.`fine`
FROM `issue`
JOIN `students` ON `issue`.`student_name` = `students`.`student_name`
WHERE `students`.`student_id` = '18'
---
    public function student_details($id){
        $data['pageTitle']='Student Details';
        $studentModel = new Student();
        $issueModel = new Store_issue();
        $data['tableData'] = $issueModel
            ->join('students', 'issue.student_name = students.student_name')
            ->select('issue.issue_id, issue.student_name, issue.book_name,issue.issue_date, issue.return_date, issue.fine')
            ->where('students.student_id', $id)
            ->get()
            ->getResult();

SELECT *
FROM `issue`
ORDER BY `issue_id` DESC
---
    public function issueDetails(){
        $store = new Store_issue();
        $data['pageTitle']='IssueDetails';
        $data['store'] = $store->orderBy('issue_id', 'DESC')->findAll();

SELECT *
FROM `issue`
WHERE `issue`.`issue_id` = '1'
---
      public function edit_issue($id){
        $issue = new Store_issue();
        $data['issue']=$issue->find($id);