app/Models/Author.php

SELECT COUNT(*) AS `numrows`
FROM `author`
---
    public function countRows()
    {
        return $this->countAllResults();