app/Models/Books.php

    public function countRows()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `books`