app/Models/Store_Issue.php

    public function countRows()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `issue`