app/Models/Student.php

SELECT COUNT(*) AS `numrows`
FROM `students`
---
    public function countRows()
    {
        return $this->countAllResults();